Pandas is based on numpy. Series are similar to numpy array/ difference is that series don't have access labels (not indexes)

1. Создать список my_data  из чисел 10,20,30 и с помощью array преобразовать в одномерный массив arr

In [2]:
import pandas as pd

my_data = [10,20,30]
     
arr = pd.array(my_data)
arr

<IntegerArray>
[10, 20, 30]
Length: 3, dtype: Int64

2. my_data передать в pd.Series в качестве  данных

In [9]:
series = pd.Series(my_data)
series

0    10
1    20
2    30
dtype: int64

3. Как левое числовое индексирование поменять на буквенное?

In [14]:
series.index = ['a', 'b', 'c']
series

a    10
b    20
c    30
dtype: int64

3. Как с использованием pandas series создать серию ser1, в которой ключами выступают страны, а значениями числа (см вывод ниже)

In [15]:
ser1 = pd.Series({'USA': 1, 'Germany': 2, 'Italy': 5, 'Japan': 4})
ser1

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

4. По такому же принципу создать серию ser2 из данных ниже

In [16]:
ser2 = pd.Series({'USA': 1, 'Germany': 2, 'USSR': 3, 'Japan': 4})
ser2

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

5. Соедините ser1 и ser2. Почему получен данный результат?

In [17]:
combined_series = ser1.append(ser2)
combined_series

C:\Users\user\AppData\Local\Temp\ipykernel_19292\4286826316.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  combined_series = ser1.append(ser2)

USA        1
Germany    2
Italy      5
Japan      4
USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

6. С использованием DataFrame создать массив df с заголовками в столбцах ['A', 'B', 'C', 'D', 'E'], в строках ['W','X','Y','Z'] в котором соответственно содержится 5 строк и 4 столбца и заполняются случайными числами с помощью randn

In [19]:
import numpy as np

In [20]:
np.random.seed(0)
df = pd.DataFrame(np.random.randn(4, 5), index=['W', 'X', 'Y', 'Z'], columns=['A', 'B', 'C', 'D', 'E'])
df

          A         B         C         D         E
W  1.764052  0.400157  0.978738  2.240893  1.867558
X -0.977278  0.950088 -0.151357 -0.103219  0.410599
Y  0.144044  1.454274  0.761038  0.121675  0.443863
Z  0.333674  1.494079 -0.205158  0.313068 -0.854096

7. Вывести все значения столбца W

In [24]:
df.iloc[:, 0]

W    1.764052
X   -0.977278
Y    0.144044
Z    0.333674
Name: A, dtype: float64

8. Вывести тип столбца W и тип датафрема df

In [27]:
df.iloc[:, 0].dtype

dtype('float64')

In [28]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
E    float64
dtype: object

9. Вывести все значения столбцов W и Z

In [30]:
df.iloc[:, [0, -1]]

          A         E
W  1.764052  1.867558
X -0.977278  0.410599
Y  0.144044  0.443863
Z  0.333674 -0.854096

10. Создать новый столбец 'new' для которого необходимо просуммировать столбцы W и Y

In [31]:
df['new'] = df.iloc[:, 0] + df.iloc[:, 2]
df

          A         B         C         D         E       new
W  1.764052  0.400157  0.978738  2.240893  1.867558  2.742790
X -0.977278  0.950088 -0.151357 -0.103219  0.410599 -1.128635
Y  0.144044  1.454274  0.761038  0.121675  0.443863  0.905081
Z  0.333674  1.494079 -0.205158  0.313068 -0.854096  0.128516

11. Удалить столбец 'new'

In [34]:
df = df.drop('new', axis=1)
df

          A         B         C         D         E
W  1.764052  0.400157  0.978738  2.240893  1.867558
X -0.977278  0.950088 -0.151357 -0.103219  0.410599
Y  0.144044  1.454274  0.761038  0.121675  0.443863
Z  0.333674  1.494079 -0.205158  0.313068 -0.854096

12. Удалить строку 'E', не применяя изменения к существующему df

In [35]:
df_dropped_E = df.drop(df.index[-1])

13. Вывести количество строк и столбцов

In [36]:
df.shape

(4, 5)

14. Вывести значения столбца 'Y'

In [37]:
df.iloc[:, 2]

W    0.978738
X   -0.151357
Y    0.761038
Z   -0.205158
Name: C, dtype: float64

15. Вывести значения строки 'C'  (сделать это двумя способами)

In [39]:
df.iloc[2]

A    0.144044
B    1.454274
C    0.761038
D    0.121675
E    0.443863
Name: Y, dtype: float64

In [41]:
df.loc[df.index[2]]

A    0.144044
B    1.454274
C    0.761038
D    0.121675
E    0.443863
Name: Y, dtype: float64

16. как вывести значение -0.746859 (находящееся в строке B и столбце Y)?

In [42]:
df.iloc[1, 2]

-0.1513572082976979

17. Как вывести значения, находящиеся в пределах строк 'A', 'B' и столбцов 'W','Y'?

In [43]:
df.iloc[[0, 1], [0, 2]]

          A         C
W  1.764052  0.978738
X -0.977278 -0.151357